% задаем кластер №1
y1=0+rand(1,30);
x1=-1+rand(1,30);
% задаем кластер №2
y2=1+rand(1,30);
x2=-1+rand(1,30);
% задаем кластер №3
y3=-1+rand(1,30);
x3=-1+rand(1,30);
% Отображаем данные на figure (1)
figure (1);
hold on;
plot(x3,y3,'og');
plot(x1,y1,'ob');
plot(x2,y2,'or');
grid on
hold off

% Зададим цели наших четырех кластеров
T3(1:30)=10;
T1(1:30)=30;
T2(1:30)=40;
% Соединим все цели кластеров
T(1:30)=T1;
T(31:60)=T2;
T(61:90)=T3;
% Соединим всю базу знаний в переменной z
x(1:30)=x1;
x(31:60)=x2;
x(61:90)=x3;
y(1:30)=y1;
y(31:60)=y2;
y(61:90)=y3;
z(1,1:90)=x;
z(2,1:90)=y;

% Зададим самообучающуюся карту
net = selforgmap([2 2]);
% Проведем цикл обучения
net = train(net, z);
a = sim(net,z);
